* Initialize languages
#+name: initialize_lang
#+source: configuration
#+begin_src emacs-lisp :results output :exports none
;; Doesn't work
 ;; first it is necessary to ensure that Org-mode loads support for the
  ;; languages used by code blocks in this article
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (ditaa      . t)     
     (dot        . t)
     (emacs-lisp . t)
     (haskell    . t)
     (org        . t)
     (perl       . t)
     (python     . t)
     (R          . t)
     (ruby       . t)
     (shell      . t)
     (sqlite     . t)))
  ;; then we'll remove the need to confirm evaluation of each code
  ;; block, NOTE: if you are concerned about execution of malicious code
  ;; through code blocks, then comment out the following line
  (setq org-confirm-babel-evaluate nil)
  ;; finally we'll customize the default behavior of Org-mode code blocks
  ;; so that they can be used to display examples of Org-mode syntax
  (setf org-babel-default-header-args:org '((:exports . "code")))
  (setq reftex-default-bibliography '("/home/emisshula/proposal/mybib.bib"))

#+end_src

#+RESULTS: configuration

#+RESULTS:

#+BEGIN_SRC elisp  :results output
(message "%s" (buffer-file-name))
#+END_SRC

#+RESULTS:

#+name: square
#+header: :var x=12
#+begin_src python :results value :exports results
return x*x
#+end_src

#+RESULTS: square
: 144

